; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_3 ?v6 - type_3 ?v2 - type_2)
 	      (pred_1 ?v1 - object ?v2 - type_2)
	      (pred_4 ?v6 - type_3 ?v4 - type_1)
	      (pred_2 ?v6 - type_3 ?v1 - object ?v4 - type_1))

   (:action op_3
       :parameters  (?v6 - type_3 ?v7 ?v5 - type_2)
       :precondition (and  (pred_3 ?v6 ?v7))
       :effect (and  (pred_3 ?v6 ?v5)
		     (not (pred_3 ?v6 ?v7))))

   (:action op_1
       :parameters (?v6 - type_3 ?v3 - object ?v8 - type_2 ?v4 - type_1)
       :precondition  (and  (pred_1 ?v3 ?v8) (pred_3 ?v6 ?v8) (pred_4 ?v6 ?v4))
       :effect (and (pred_2 ?v6 ?v3 ?v4)
		    (not (pred_1 ?v3 ?v8)) 
		    (not (pred_4 ?v6 ?v4))))

   (:action op_2
       :parameters (?v6 - type_3 ?v3 - object ?v8 - type_2 ?v4 - type_1)
       :precondition  (and  (pred_2 ?v6 ?v3 ?v4) (pred_3 ?v6 ?v8))
       :effect (and (pred_1 ?v3 ?v8)
		    (pred_4 ?v6 ?v4)
		    (not (pred_2 ?v6 ?v3 ?v4)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_01 obj_07 - type_3
obj_08 obj_14 obj_05 obj_10 - type_1
obj_03 obj_04 obj_06 obj_02 - type_2
obj_09 obj_12 obj_13 obj_11 - object)
(:init
(pred_3 obj_01 obj_06)
(pred_4 obj_01 obj_08)
(pred_4 obj_01 obj_14)
(pred_3 obj_07 obj_03)
(pred_4 obj_07 obj_05)
(pred_4 obj_07 obj_10)
(pred_1 obj_09 obj_04)
(pred_1 obj_12 obj_04)
(pred_1 obj_13 obj_02)
(pred_1 obj_11 obj_02)
)
(:goal
(and
(pred_1 obj_09 obj_03)
(pred_1 obj_12 obj_03)
(pred_1 obj_13 obj_06)
(pred_1 obj_11 obj_03)
)
)

(:constraints
  (always (not (pred_3 obj_01 obj_02)))
)
)

; plan
1. (op_3 obj_01 obj_06 obj_04)
   deleted: (pred_3 obj_01 obj_06)
   added: (pred_3 obj_01 obj_04)
   goals met: 0 of 4
2. (op_3 obj_07 obj_03 obj_02)
   deleted: (pred_3 obj_07 obj_03)
   added: (pred_3 obj_07 obj_02)
   goals met: 0 of 4
3. (op_1 obj_07 obj_11 obj_02 obj_10)
   deleted: (pred_1 obj_11 obj_02) (pred_4 obj_07 obj_10)
   added: (pred_2 obj_07 obj_11 obj_10)
   goals met: 0 of 4
4. (op_1 obj_07 obj_13 obj_02 obj_05)
   deleted: (pred_1 obj_13 obj_02) (pred_4 obj_07 obj_05)
   added: (pred_2 obj_07 obj_13 obj_05)
   goals met: 0 of 4
5. (op_1 obj_01 obj_12 obj_04 obj_14)
   deleted: (pred_1 obj_12 obj_04) (pred_4 obj_01 obj_14)
   added: (pred_2 obj_01 obj_12 obj_14)
   goals met: 0 of 4
6. (op_1 obj_01 obj_09 obj_04 obj_08)
   deleted: (pred_1 obj_09 obj_04) (pred_4 obj_01 obj_08)
   added: (pred_2 obj_01 obj_09 obj_08)
   goals met: 0 of 4
7. (op_3 obj_07 obj_02 obj_06)
   deleted: (pred_3 obj_07 obj_02)
   added: (pred_3 obj_07 obj_06)
   goals met: 0 of 4
8. (op_3 obj_01 obj_04 obj_03)
   deleted: (pred_3 obj_01 obj_04)
   added: (pred_3 obj_01 obj_03)
   goals met: 0 of 4
9. (op_2 obj_07 obj_13 obj_06 obj_05)
   deleted: (pred_2 obj_07 obj_13 obj_05)
   added: (pred_1 obj_13 obj_06) (pred_4 obj_07 obj_05)
   goals met: 1 of 4
10. (op_2 obj_01 obj_12 obj_03 obj_14)
   deleted: (pred_2 obj_01 obj_12 obj_14)
   added: (pred_1 obj_12 obj_03) (pred_4 obj_01 obj_14)
   goals met: 2 of 4
11. (op_2 obj_01 obj_09 obj_03 obj_08)
   deleted: (pred_2 obj_01 obj_09 obj_08)
   added: (pred_1 obj_09 obj_03) (pred_4 obj_01 obj_08)
   goals met: 3 of 4
12. (op_3 obj_07 obj_06 obj_03)
   deleted: (pred_3 obj_07 obj_06)
   added: (pred_3 obj_07 obj_03)
   goals met: 3 of 4
13. (op_2 obj_07 obj_11 obj_03 obj_10)
   deleted: (pred_2 obj_07 obj_11 obj_10)
   added: (pred_1 obj_11 obj_03) (pred_4 obj_07 obj_10)
   goals met: 4 of 4
